Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 他扬起手里的旗，瞬间电光闪耀……
en_us: He raised the gonfalon in his hand which instantly sparked with lightning…

source: 他抬头一看，只见原本石块一块块的挪开，自动堆积成一层层叠起，不到半会就变成了台阶，直接通往上空。
en_us: He raised his head and saw the neatly arranged bricks from the wall moving out one by one. The bricks automatically stacked themselves atop one another, forming a flight of stairs that led directly into the sky.

source: 他抱拳突然朝着她跪了下去，“弟子斗胆，能否请师父与我同行，前去玄天宗。”
en_us: He cupped his fists and suddenly knelt in front of her, "Pardon my boldness, but may I ask that Master accompany me on this journey to the Blackheaven Sect?"

source: 他拼了命的挤眼睛，郁海珩这回总算看懂了他的意思，有些不甘冷哼了一声，这才压下了心底的火气，朝旁边的一个游仙长老使了个眼色。对方点了点头，身形一闪，顿时消失在大厅。
en_us: He desperately winked and Yu Hai Heng finally understood what he meant. With a begrudging sneer, he finally suppressed his anger and signalled the traveling immortal Elder beside. The other party nodded and with a flash, disappeared from the hall.

source: 他捏了个诀，手里的玉笛化出剑招，数十道剑气瞬间打在了石壁上。只听轰隆一声，前方的山壁瞬间塌了下来，露出一片更加广阔的空间。
en_us: Lonemoon produced a hand seal and the jade flute in his hand at once transformed into a sword. Numerous beams of Sword Qi struck the stone wall. There was a huge bang, and the mountain wall in front collapsed instantly, revealing a wider space.

source: 他捏了个诀，用力一挥手上的武器，用了九成的法术打在那阵法上。只听见天地间咚的一声回响，声音极大，瞬间仿佛传遍了整个秘境，但那阵法却安然无恙，一点都没有缺角少边的意思。
en_us: Producing a hand seal, he swung down the weapon in his hand forcefully, striking the array using ninety percent of the power of his Dharmic spells. Bang! A thunderous sound echoed through heaven and earth. The sound was so loud that it seemed to reverberate throughout the mystic realm, but the array itself was untouched; there were no signs of damage anywhere.

source: 他提醒的话还没说完，却看到沈萤轻轻抬手一抓，那来势汹汹的鬼爪瞬间就停在了她的胸前。
en_us: But before he could complete his warning, he saw Shen Ying deftly raising her hand to catch something. Those ferocious ghost claws stopped in front of her chest in an instant.

source: 他收了收下巴，这才走了进去。
en_us: He closed his gaping mouth and walked in.

source: 他放下灵神丹盘坐入定，三个多时辰后准时清醒过来，立即吞服了一枚灵神丹，开始转修江水决。
en_us: He put down his Spirit Pills, sat cross-legged and started meditating. After more than six hours, he woke up punctually and, after immediately swallowing a Spirit Pill, started to practice the Jiang Water Art technique.

source: 他救人心切，也没想那么多，直接就入了塔。
en_us: He was rushing to rescue people and could not afford to hesitate any longer. Pushing the thought aside, he rushed into the pagoda.

source: 他整个人都呆住了，小眼圈都红了，满满都是委屈。
en_us: He was shocked and did not know what to do, while his eyes reddened with indignance.

source: 他整整图谋了六千六百年，只为进入天庭的这一天！
en_us: He had conspired for 6600 years just for this day, the day he would enter the Heavenly Court!

source: 他整整在院前站了一刻钟，直到厨房那个身影，端着菜快步走进了屋内。他才想起自己的目的。想想现在的时间，羿清还是一个金丹修士，并不是将来那个三界闻名的仙人，有所不同也是正常的，正常的。
en_us: He stood in front of the yard for a whole quarter of an hour, until the figure in the kitchen walked into the house at a brisk pace with his vegetables. Then he remembered his purpose. At present, Yi Qing was still a Golden Core cultivator and not the future immortal of the Three Realms. So if Yi Qing was not quite what he had imagined him to be, it was reasonable. Totally reasonable.

source: 他整整想了五天，勉强接受了这个事实。这才慢慢回过味来，很明显这个叫沈萤的跟他一样，也是知道剧情的，而且还先一步做了跟他一样的打算。也就是说，他TM被截胡了。
en_us: He had fallen into contemplation for five full days before reluctantly accepting this fact. Finally recovering from shock, it was obvious that the individual named Shen Ying was just like him, and also knew about the storyline. Moreover, she had been one step ahead in making the same decision as him. This also meant that his plan was freaking intercepted.

source: 他早早运转一缕黑色元力去了眼中，马飞那把剑刺来的速度和轨迹他预算得清清楚楚，自然不会傻乎乎的朝他拳头砸去。
en_us: Jiang Yi had already transferred a wisp of black essence force to his eyes earlier, and could hence clearly predict the speed and trajectory of Ma Fei's sword. He certainly was not foolish enough to take it on with his fist.

source: 他是ZZ才会担心她们会被自己的劫雷波及，劈死她们才好！
en_us: He must have been crazy to worry that they would be injured by the Lightning Tribulation. Let the Lightning Tribulation strike them!

source: 他是江家子弟，万一给人看到他进出聚珍阁，还是去卖丹药！这很容易给人怀疑他偷炼丹房内的丹药出来卖的，所以他不得不小心些。
en_us: He is a descendant of the Jiang Clan. What if someone spotted him going into the Pearl Gathering Pavilion and, moreover, going to selling elixirs! This would easily raise people's suspicions of him stealing the elixirs from the alchemy lab and selling them outside. As such, he had to be more careful.

source: 他暗暗告诉自己要镇定，抬头望着那管事，漠然说道：“你要什么说法？”
en_us: He silently told himself to remain calm. He raised his head to look at the housekeeper and coldly asked, "How do you want to settle this?"

source: 他有些不敢置信的睁大了眼，原来这座上古秘境之中，居然隐藏着一座上界的仙宫！
en_us: Lonemoon widened his eyes in disbelief. So an immortal pavilion from the upper world was actually hidden inside the Ancient Realm!

source: 他有些为难的笑了笑道，“那个……郁家家主一向冲动，又不知大仙的本事，一会进去可能多有冒犯。还忘大仙能多多包含。”
en_us: He forced a smile and said, "Well.. The Yu Family Family Master has always been rash and he is unaware of your capabilities. He might offend you inside. Please be patient with him, Great Immortal."

source: 他松了口气，“请师父教导。”
en_us: He breathed a sigh of relief, "Master, please give me your guidance."

source: 他果然瞎了，会认为这么个吃货，是个顾全大局的人。还有，剑仙你已经坦然接受厨子的称号了吗？要不要这么快啊喂！
en_us: I must have been blind, to think that a foodie like her could think of the big picture. And Sword Immortal, have you so readily accepted the title of chef? Do you really have to be so quick about it?

source: 他正打算细问，转眼却见到站在了沈萤身后的羿清，瞬间明白了他们的打算。
en_us: Just as he was planning to ask about it in detail, he turned and saw Yi Qing standing behind Shen Ying and instinctively understood what they planned to do.

source: 他正要问，沈萤已经转身打算从那门跳回去了。
en_us: Shen Ying had already turned and prepared to jump back through that Gate before he was could even ask.

source: 他此刻经脉内的元力全是由江水诀形成的蓝色，再无一丝黑色存在。
en_us: At this moment, his meridians were all filled with blue essence force from the Jiang Water Art; not a sliver of black essence force remained.

source: 他沉吟一会，放下江如虎的腿，抬腿对着江如虎血肉模糊的脑袋踩去，身子凑过去，压低声音说道：“江如虎，你可知道我现在是什么境界？你可知道我为何能一拳砸飞江如鹰？你可知道为何我敢如此对你？实话告诉你把，我就是想把事情闹大，让整个江家都知道……我江逸不是废物！你们才是废物！”
en_us: He muttered deeply to himself for a moment, before letting go of Jiang Ruhu's leg. He raised his own leg and stepped down onto Jiang Ruhu's badly mutilated head. Moving his body close to Jiang Ruhu, he lowered his voice and quietly said, "Jiang Ruhu, do you know what power level in the Cast Tripod Realm I am at right now? Do you know how I was able to sned Jiang Ruying flying with just a single punch? Do you know why I dare to do this to you? To tell you the truth, I want to make things big, and let the entire Jiang Clan know that... I, Jiang Yi, am not a useless good-for-nothing! You guys are the good-for-nothing wastrels!"

source: 他沉吟了一阵，最终下定决心弄一弄，抵押在风月楼那块令牌，如一把悬浮在他头上的利剑般压得他透不过气来……
en_us: He heaved a deep sigh for a moment before finally making up his mind to give it a shot. The command token he had given to the Fengyue Brothel as collateral was etched in his mind like a sharp sword floating over his head, pressuring and stressing him out until he could not breathe...

source: 他沉吟了一阵，调集了一缕黑色元力去辅助疗伤，等那缕黑色元力消耗完后，他才连忙打坐运转无名功法。
en_us: He muttered to himself for a short moment before collecting a strand of black essence force to facilitate the healing of the wound. Only after consuming that strand of black essence force did he hastily sit cross-legged to work on the nameless cultivation technique again.

source: 他沉喝一声，拳头幻化出三个拳影，分别朝江如虎的脑袋，左肩，小腹砸去。
en_us: He shouted deeply and loudly as his fists transformed into three fist-like silhouette images, with each individually hitting in the direction of Jiang Ruhu's head, left shoulder and lower abdomen.

source: 他沉默了一会，似是不知道怎么开口，半会才道，“是这样的，印家家主对大仙有几分好奇，听闻大仙到此，所以托我前来请示一下，看能否与您见上一面。”
en_us: He then fell silent, however, as if he did not know what to say next. After a few seconds, he said, "It's like this. The Yin Family Master is extremely curious about you, Great Immortal. He has heard that you have arrived here, so he asked me to come down and ask if you would be willing to meet him."

source: 他沉默了很久，再次问道：“杨管事，如果我和你们合作，是否就……失去了自由之身？”
en_us: He remained silent for a very long time, before finally asking once again, "Manager Yang, if I work with you, will I... lose my freedom?"

source: 他没有回答，反正笑得越来越张狂，眼神又恢复到刚刚轻蔑的样子，看她们如同在看一群死物一般。
en_us: He did not answer her, but began to laugh maniacally. His eyes were once again filled with disdain as he began to imagine them lying dead on the ground.

source: 他没有说下去，这么多魔气，要是再从魔界出来一两只魔族，他们必死无疑。唯一的指望是现在还在曲双城中的仙帝戈尤，但这会也没办法传讯出去啊？
en_us: He did not complete his sentence. With all these demonic Qi around, should they encounter any more demonic beast, there is no doubt that they will be dead. For now, they can only put all their hopes on the Immortal Emperor Ge You, who is still in Qushuang City. However, there is no way for them to pass any message out?

source: 他没跟游仙交过手，但沈萤最少也能跟他打个平手吧？再加上他和羿清，不说稳赢，也不至于输。他打算好了一切，以他跟沈萤的交情，这个忙……
en_us: He had never fought against a Traveling Immortal before, but Shen Ying had seemed to tie with the Traveling Immortal. If he and Yi Qing fought alongside her, even if they didn't win, they surely wouldn't lose. They had a strong relationship, so surely she would help…

source: 他深吸了一口气，哼！算了，不跟女人计较。
en_us: He took a deep breath. Forget it. I won't quibble with a woman.

source: 他点了点头，“我轩辕家向来擅长丹药，在下于练丹一途也算是略有小成，他们这种情况，其实算不上大事。只需一粒八品的养神丹便可恢复，损伤的容貌也能恢复。刚巧我前些日子练了一炉养神丹，可赠与贵派。”
en_us: He nodded and said, "My Xuan Yuan Family has always been skilled when it comes to elixirs, and I have some minor achievements in the path of refining pills. Their situations are actually not too big of a problem. With an eighth-grade nourishing elixir, they should be able to heal their wounds and recover their looks. It just so happens that I have just refined a batch of nourishing elixirs which I can gift to your sect."

source: 他点了点头，羿清已经上前一步开口，“你是何人，为何擅闯无敌派？”
en_us: Yi Qing nodded and walked toward the man, "Who are you and why are you invading Invincible Sect?"

source: 他爆喝一声，元力从掌心运转而出，那把青色的短剑立即青光大盛，寒意逼人，他化掌为爪，那把短剑竟在他手心快速旋转起来，朝江逸拳头直刺而去。
en_us: Ma Fei roared, essence force flowing out from his palm. The teal-colored sword immediately shone even brighter, emitting a chilling aura. He drew his hand into a claw; the short sword began spinning rapidly on his palm before piercing through the air, aiming directly at Jiang Yi's fist.

source: 他猛然醒悟过来，吓得差点魂飞魄散。在他现在这个阶段，不同属性的元力是绝对不能同时运转的，否则一旦冲撞起来，不同属性元力在体内絮乱暴动的话，他全身经脉和血脉都有可能因此爆掉……
en_us: He abruptly realised his mistake and was scared out of his wits. In the condition he was in right now, essence force of different elements couldn’t be circulated together at the same time, otherwise they would clash and create disorder in the body. The meridians and blood vessels in his body would simply explode from the collisions…

source: 他猜测自己绝对不是什么狗屁灵体，自己修炼如此之慢是因为那个鬼封印的缘故。他能拥有如此变态的反应能力，也不是灵体之缘故，而黑色元力能让他视力变得极其恐怖，能让和他对练的武者武技快速大成，也很有可能是因为这黑色元力的缘故。
en_us: He guessed that he himself was certainly not some silly superpower soul, and he knew that the reason why his own cultivation speed was that slow was due to that damned seal. The fact that he possessed such obscenely powerful ability to react was not caused by his soul, but his black essence forces that allowed his ability of sight to become horrendously powerful; that the combat abilities of the martial artists that sparred with him were able to improve so quickly, was also very likely a result of using that black essence force.

source: 他现在恨不得每时每刻都修炼，恨不得一天之内就把那封印解开了，看看他的修炼速度是否能如大长老估计般，比大少爷江恨水还要快？不说比江恨水快，就算比他慢上一丝，江逸也有信心凭借黑色元力，让自己实力突飞猛涨。
en_us: He itched to spend every available second of his time refining essence force and wished with all his heart that he could break that seal within a single day. He wanted to see if his refining speed was indeed faster than that of Great Young Master Jiang Henshui, as the grand elder predicted? To say nothing of being faster than Jiang Henshui, even if he were slower than Jiang Henshui by just a smidgen, Jiang Yi was confident that he could borrow the power of the black essence force and allow his own abilities to advance by leaps and bounds.

source: 他现在有变态的修炼速度，有黑色元力如此神奇的能量，那么多有利的条件还不努力修炼，那么他就是真的是废材了。
en_us: With a godly cultivation speed and mystical powers from the black essence forces, not working hard to cultivate his abilities would be an utter waste with so many favorable conditions on his side.

source: 他甚至能感觉到，从回院子的这一路行来，各门派看他们的眼神都不一样了。有忌惮的，羡慕，也有震惊的，就是没了之前的那种轻视。孤月广告宣传的目的已经达到了，他仿佛看到，下回去上青城收徒时，排在自己前面的人山人海了。
en_us: On their way back, Lonemoon noticed that the way people looked at their sect had changed. Some looked at them with jealousy, others with envy, and yet some others with pure shock. No one was looking down on them like they did before. Lonemoon had achieved his marketing goal. He could already imagine the long queue in front of their recruitment stand at Upper Azure Town.

source: 他生来就是印家家主之子，而且又是百年难出一个的雷灵根。修行顺畅，天赋极高。自小就是青年这一辈中最杰出的弟子，无论是在各派还是四大家族中，很少遇到过敌手。这是他第一次，第一次被人辗压，而且对方还是个女修。恰又是情窦初开的年纪，自然也就将对方放在了心上。偏偏对方性子看着柔弱，对他却好似没有半点那方面的意思。
en_us: He was born into the Yin Family, and was the son of the Yin Family Master no less. He also had a rare lightning-elemental Spirit Root. His cultivation journey had been smooth and he was truly talented. He had always been the best disciple - there was hardly anyone who was his match in his sect and even among the four aristocratic families. That was his first time being on the lower hand, and the one who put him in that position was a female cultivator who was at the age when she was ready for romance. Naturally, she moved his heart. Yet, she looked frail and not at all interested in him romantically.

source: 他用力的揉了揉额头，深吸了一口气才压下满心的槽点，“今天就先到这里了，你们先下去休息吧，修行的事明日再说。”
en_us: Lonemoon rubbed his forehead and took a deep breath before suppressing all the curses in his heart. "That's it for today. You guys can go and take a rest. We will talk about cultivation matters tomorrow."

source: 他的意思很明显，江逸在这，他不方面下手偷药……
en_us: His intentions were obvious: with Jiang Yi around, it was not convenient for him to grab the herbs as he pleased…

source: 他的拳头又一次没入到青石板下面的土里。
en_us: His fist did not reach the ground below the limestone slab again.

source: 他的拳头顷刻间化作三道残影，给人感觉他的拳头这一刻分成了三个般，每个都无比真实，分别对着冲进来的那护卫的左肩，右肩，脑门砸去。
en_us: His fist instantly transformed into three phantom shadows, giving an illusion that his fist had split into three, each no different from the real one. He smashed the fists into the attacking guard's left shoulder, right shoulder, and forehead.

source: 他的灵气……
en_us: Hi Spirit Qi...

source: 他的眼眸突然泛红起来，盯着钱万贯恶狠狠的说道：“小胖子，你给我听着，我江逸是孤儿，我没有父母，这件事情你要是敢外传，我就算拼了命也会诛杀你的！”
en_us: His eyes suddenly turned red, and stared fiercely at Qian Wanguan. He said, "Fatty, you better listen to me. I, Jiang Yi, am an orphan. I do not have a father. If you dare leak any of these news to anyone, mark my words, I will murder you!"

source: 他的眼神这才猛的一睁，原本一片迷雾般的眼里瞬间清明，条件反射的大喊了一声，“卧槽！”
en_us: Lonemoon's eyes suddenly widened. The mist that was once in his eyes were now gone. Then, Lonemoon exclaimed, "Holy shit!"

source: 他的脸色却越加的愧疚，犹豫了一会才一咬牙道，“徒儿的确有一事相商，还忘师父成全！”
en_us: But his face showed the increasing guilt within him. He hesitated for a while before saying with conviction, "Indeed, I have a matter to consult with you, and I hope that Master will allow it!"

source: 他的身世必须掩藏，一旦曝光或者被有心人知道，他和江云海的处境将会变得极其危险，要知道镇西王还有一个儿子叫江逆流。
en_us: His background must be hidden. Once his secret is exposed, or someone with ill intent finds out that Western Garrison Liege Lord actually had another son called Jiang Yiliu, Jiang Yunhai and his situation would become very precarious.

source: 他皱了皱眉，似是想到了什么才继续道，“后来我找到一个方法，就是制造一个仙胎，投生其中，虽然需要暂时封印住全部的修为，记忆，但却能以轮回之力，慢慢洗净身上的魔种。最多只需几千年的时间，我的修为就可以完全恢复无忧。所以……”
en_us: His eyebrows furrowed, as if he recalled something and continued, " Afterwards I found a solution, which is to create an Immortal Foetus and be reborn as that. Even though I'll need to seal all of my Cultivation and memories for the time being, I could make use of the Power of Rebirth to rid myself clean of the Demon Seed. Within a thousand years of Cultivation, my powers will be back to normal, so..."

source: 他皱眉想了想，心底已经有了对策，但想到这毕竟是下面弟子的历练，除非遇到他们应付不了的局面，不然他也不好插手，只好压下猜测扫了一眼前面的人。
en_us: He frowned and pondered over it. He came up with a strategy, but then remembered that this was the experiential training of the disciples. Unless they met with a situation they couldn’t deal with, otherwise he should not intervene. So he kept his thoughts to himself and swept his gaze over the people in front.

source: 他目光一冷，朝左边的小树林内扫去，暗道难道是江如虎等人来堵他了？
en_us: He froze his gaze and swept his gaze towards the small forest to his left. He muttered to himself and wondered if it were Jiang Ruhu and his gang of cronies who had come here to block him.

source: 他目光在偏厅内一扫，看到左边墙边书柜上有很多书册，连忙走过去查看起来。很快他找到了一本关于药草简介的书籍，里面竟还有简易的图画，立即大喜的捧着书册朝药材房内走去，准备对着书册取出柳长老所需的药草。
en_us: He swept a glance across the side room and saw many booklets on the bookshelf next to the left-side wall. He quickly walked over to check them out. He quickly found a book containing summaries and brief introductions to various medicinal herbs, as well as some simple-to-understand pictures inside. Delighted, he immediately carried the book over to the ingredient storage room, prepared to cross-reference with the book and retrieve the medicinal ingredients required by Elder Liu.

source: 他目光在广场上一扫，突然被广场北方的一座宏伟大殿吸引了，主要是此刻大殿外围满了人，很是热闹，让他有些好奇。
en_us: He swept his eyes across the city plaza and was suddenly attracted by a huge, imposing grand hall to the north of the plaza. What caught his eye was that the grand hall was surrounded by throngs of people. This atmosphere was very noisy and exciting, which made him somewhat curious.

source: 他直接冲了过去，化出剑意，同一时间羿清也出了手，两道剑意全力朝着对方攻击了过去。
en_us: He immediately rushed over and manifested sword intent, and at the same time, Yi Qing also put in his attack. Both of their sword intents were sent fully blasting towards the other party.

source: 他直接捏了个诀，顿时纸鹤瞬间化为白光，在空中形成巴掌大的一个“战”字，隐隐还透着些杀伐之意。
en_us: He immediately produced a hand seal and the paper crane instantly turned into a stream of white light, forming the character "Duel" in the air. A faint killing vibe emanated from it.

source: 他直接调动灵气，顿时围身出现了数把灵剑，齐齐对准了沈萤：“别以为丈着自己修为高就可以横行上青界，今日我枫影就要讨回这个公道。”紧接着他直接在神识中传音，“系统，马上帮我筛选可以致胜的功法，激发我全部潜能，今日我非要教训教训这个无敌派掌门不可。”
en_us: He immediately mobilized his Spirit Qi and tons of spirit swords appeared around him, all aiming right at Shen Ying, "Don't think that just because you have a high level of cultivation, you can do whatever you want in the Upper Azure World. Today, I, Feng Ying, am going to seek justice." He then transmitted his thoughts through divine perception, "System, immediately pick a sure win cultivation technique and stimulate all of my potential. I must teach this Invincible Sect's Sect Master a lesson today."

source: 他看了半天也没看出这花除了灵气有些特殊外，有什么特别的地方。况且白天的时候，就连萝卜也没有看出什么问题。
en_us: Lonemoon studied the flower, but no matter how long and hard he looked, he could not find anything special about it apart from its emanation of Spirit Qi. Even Radish could not tell it was that special.

source: 他看了沈萤一眼，嘴角不受控制的抽了抽，他现在都有些不敢相信，灵主的口味，这么奇特。
en_us: He glanced at Shen Ying and subconsciously pursed his lips. He still could not believe that his Spirit Master had such a strange taste in partners.

source: 他看了看众人离开的方向，“看样子，应该是惹到了什么麻烦，才顺势躲到了这里，而且还是个不小的麻烦。”
en_us: He looked in the direction which they had left. "From the look of things, they probably met with some trouble which is why they seized the opportunity to hide here, and that trouble must be pretty huge."

source: 他看了看屋子里已经变得惨不忍睹的地面，失笑着摇摇头转身跃出屋门，来到后院站定，将一丝黑色元力输送到右脚的足少阴肾经处，对着地面一块青石板踩下。
en_us: Looking at the terrible state of the room, Jiang Yi shook his head and walked out to the back yard. He channeled a sliver of black essence force into his right foot and stomped down on a limestone slab on the ground.

source: 他看到江恨水虽然面色微微变幻了一下，却没有出声阻拦，更别说训斥了，内心更加黯然了。原本孩童时和江恨水结下的一丝情谊也烟消云散了，他自嘲的笑了笑，弯身拱手道：“江逸拜见大少爷。”
en_us: Jiang Yi sighed in his heart. When he saw Jiang Henshui's face slightly change color, yet say absolutely nothing to stop Jiang Ruhu or even chide him, Jiang Yi felt sad. The threads of friendship he had formed with Jiang Henshui when they were children seemed to have disappeared completely. Smiling in self-mockery, he bent down in a bow, cupped his hands and said, "Jiang Yi greets Great Young Master."

source: 他看到江逸当着他的面断了江如虎的腿，顿时睁目欲裂，浑身杀气如虹，双腿一瞪整个人如一头疯牛般横冲直撞而来。
en_us: Witnessing Jiang Yi breaking Jiang Ruhu's leg, his eyes instantly broke wide opened as a killing aura cloaked his body. With a burst of his leg muscle, his entire body rushed towards Jiang Yi like a frenzied bull.

source: 他看江逸这样子，也不敢过于劝说，点了点头道：“行，这事我保证不外传，不过你的情报太明显了，随便一个人去天羽城查查就能知道，你想隐瞒身份除非把天羽城的人全杀了，要是江麒麟去查了你的资料，再上报给镇西王……”
en_us: He saw Jiang Yi's behaviour and did not dare say much, but merely nodded and mentioned, "Sure, I assure you that this would not spread to anyone else. However, your information is too obvious and easy to obtain. Just by sending someone to Skyplume City to check and they would know. Unless you kill the entire Skyplume city, it would be impossible for you to hide your identity. If Jiang Qilin checked up on you and presented his findings to the Lord..."

source: 他眼睛越睁越大，突然觉得这些相处了几百年宗门，有些陌生起来。
en_us: His eyes kept widening. He suddenly felt like a stranger in the sect which he had been a part of for hundreds of years.

source: 他眼神一沉，突然从怀里掏出个什么，四下一看转身往后殿的方向飞去，把手里的东西往墙上一拍，顿时整面墙咔吱一下，裂出一个通道来，“果然是这里。”
en_us: He looked down, suddenly took out something from a pocket and flew to the back of the hall. He tapped it on the wall, and the wall immediately opened a pathway. "It is indeed over here."

source: 他眼神有些不受控制的看向萝卜。
en_us: His gaze uncontrollably turned towards the radish.

source: 他眼里的光顿时一暗，越加委屈了。紧了紧身侧的手，朝她走近两步，脸瞬间涨得通红，深吸了一口气，才似找到声音般道，“萤……萤，玄灵花我……我只给过你一个人。”
en_us: His eyes dimmed and he looked even more unwilling. He clenched his fists by his side and stepped foward toward her, his face flushing a deep red. He took in a deep breath and finally found his voice, "Shen... Ying, you are the only one I have ever given the Black Spirit Blossom to."

source: 他睁开眼睛大笑起来，笑着笑着又开始流泪，整个人疯子般完全不能自己了。多年的压抑，多年的苦闷，在这一刻似乎完全发泄了出来。
en_us: He opened his eyes and started laughing aloud. Despite this, he shed tears as he laughed. It was as if he had gone mad. So many years of cruel oppression, so many years of bitter depression. At that moment, he could finally and completely release it all.

source: 他瞬间猜到了怎么回事？无非是为了那个千叶草木灵，不过……这才过了多久啊，五个游仙就这么趴了，而且那惨不忍睹的样，你到底做了什么啊喂！
en_us: Immediately, he understood what was going on. They were after the Thousand Leaves Vegetation Spirit. Yet… it had only been awhile and the five of them were already lying motionless atop one another. It was a tragic sight. What exactly did you do to them?

source: 他突然想到什么，有些犹豫转头看了沈萤一眼，“此去玄天宗，路途遥远，弟子才疏学浅，万一要是此幡出现了什么变故，怕是有心无力。”
en_us: He suddenly thought of something as he turned his head hesitantly towards Shen Ying to look at her, "This trip to the Blackheaven Sect is going to be a very long journey. My knowledge and ability is very limited. If anything were to happen to the gonfalon, I'm afraid that it would be beyond my capabilities to salvage the situation."
